Revit 2027 API
AnalyticalNodeData.GetConnectionStatus Method
 Returns the Connection Status for this Analytical Node.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AnalyticalNodeConnectionStatus GetConnectionStatus()
Public Function GetConnectionStatus As AnalyticalNodeConnectionStatus
public:
AnalyticalNodeConnectionStatus GetConnectionStatus()
member GetConnectionStatus : unit -> AnalyticalNodeConnectionStatus
Return Value
AnalyticalNodeConnectionStatus
See Also
Reference
AnalyticalNodeData Class
Autodesk.Revit.DB.Structure Namespace